examples/hello-generated.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Hello</wsa:Action>
        <wsa:MessageID>urn:uuid:c3bdeff4-aca9-440c-9a14-28b5344a82f1</wsa:MessageID>
        <wsd:AppSequence InstanceId="1741451004" SequenceId="urn:uuid:ac1cc3c1-8529-4056-83c6-892ce41e4c7a" MessageNumber="2" />
    </soap:Header>
    <soap:Body>
        <wsd:Hello>
            <wsa:EndpointReference>
                <wsa:Address>urn:uuid:ce7d4890-607b-d28f-45b3-b6ee5f3168cd</wsa:Address>
            </wsa:EndpointReference>
            <wsd:XAddrs>http://[fe80::215:5dff:fe30:264c]:5357/ce7d4890-607b-d28f-45b3-b6ee5f3168cd</wsd:XAddrs>
            <wsd:MetadataVersion>1</wsd:MetadataVersion>
        </wsd:Hello>
    </soap:Body>
</soap:Envelope>
